In [1]:
import pandas as pd
url = 'https://raw.githubusercontent.com/WalePhenomenon/climate_change/master/fuel_ferc1.csv'
fd = pd.read_csv(url)

In [2]:
fd.head()

,record_id,utility_id_ferc1,report_year,plant_name_ferc1,fuel_type_code_pudl,fuel_unit,fuel_qty_burned,fuel_mmbtu_per_unit,fuel_cost_per_unit_burned,fuel_cost_per_unit_delivered,fuel_cost_per_mmbtu
0,f1_fuel_1994_12_1_0_7,1,1994,rockport,coal,ton,5377489.0,16.590,18.59,18.53,1.121
1,f1_fuel_1994_12_1_0_10,1,1994,rockport total plant,coal,ton,10486945.0,16.592,18.58,18.53,1.120
2,f1_fuel_1994_12_2_0_1,2,1994,gorgas,coal,ton,2978683.0,24.130,39.72,38.12,1.650
3,f1_fuel_1994_12_2_0_7,2,1994,barry,coal,ton,3739484.0,23.950,47.21,45.99,1.970
4,f1_fuel_1994_12_2_0_10,2,1994,chickasaw,gas,mcf,40533.0,1.000,2.77,2.77,2.570

In [7]:
fd.groupby('fuel_type_code_pudl').mean()['fuel_cost_per_unit_burned']

fuel_type_code_pudl
coal         67.421830
gas          13.659397
nuclear    4955.157002
oil         168.877086
other        18.253856
waste        19.518122
Name: fuel_cost_per_unit_burned, dtype: float64

In [9]:
fd['fuel_mmbtu_per_unit'].describe()

count    29523.000000
mean         8.492111
std         10.600220
min          0.000001
25%          1.024000
50%          5.762694
75%         17.006000
max        341.260000
Name: fuel_mmbtu_per_unit, dtype: float64

In [12]:
fd['fuel_qty_burned'].skew()

15.851495469109503

In [13]:
fd['fuel_qty_burned'].kurt()

651.3694501337732

In [19]:
fd.groupby('report_year')[['report_year', 'fuel_cost_per_unit_delivered']].mean().max()

report_year                      2018.000000
fuel_cost_per_unit_delivered    11140.197239
dtype: float64

In [22]:
fd.isnull().sum()

record_id                         0
utility_id_ferc1                  0
report_year                       0
plant_name_ferc1                  0
fuel_type_code_pudl               0
fuel_unit                       180
fuel_qty_burned                   0
fuel_mmbtu_per_unit               0
fuel_cost_per_unit_burned         0
fuel_cost_per_unit_delivered      0
fuel_cost_per_mmbtu               0
dtype: int64

In [23]:
len(fd['fuel_unit'])

29523

In [24]:
perc = (180/29523) * 100

In [25]:
print(perc)

0.609694136774718

In [26]:
fd.head()

,record_id,utility_id_ferc1,report_year,plant_name_ferc1,fuel_type_code_pudl,fuel_unit,fuel_qty_burned,fuel_mmbtu_per_unit,fuel_cost_per_unit_burned,fuel_cost_per_unit_delivered,fuel_cost_per_mmbtu
0,f1_fuel_1994_12_1_0_7,1,1994,rockport,coal,ton,5377489.0,16.590,18.59,18.53,1.121
1,f1_fuel_1994_12_1_0_10,1,1994,rockport total plant,coal,ton,10486945.0,16.592,18.58,18.53,1.120
2,f1_fuel_1994_12_2_0_1,2,1994,gorgas,coal,ton,2978683.0,24.130,39.72,38.12,1.650
3,f1_fuel_1994_12_2_0_7,2,1994,barry,coal,ton,3739484.0,23.950,47.21,45.99,1.970
4,f1_fuel_1994_12_2_0_10,2,1994,chickasaw,gas,mcf,40533.0,1.000,2.77,2.77,2.570

In [30]:
ft = fd.groupby('fuel_type_code_pudl')

In [35]:
ft2 =ft.get_group('coal')[['report_year','fuel_cost_per_unit_burned']]

In [39]:
ft2

       report_year  fuel_cost_per_unit_burned
0             1994                     18.590
1             1994                     18.580
2             1994                     39.720
3             1994                     47.210
5             1994                     44.240
...            ...                        ...
29503         2018                     26.775
29510         2018                     14.760
29516         2018                     14.760
29517         2018                     13.690
29521         2018                      3.060

[8547 rows x 2 columns]

In [40]:
ft2.where(ft2.report_year == 1998)

       report_year  fuel_cost_per_unit_burned
0              NaN                        NaN
1              NaN                        NaN
2              NaN                        NaN
3              NaN                        NaN
5              NaN                        NaN
...            ...                        ...
29503          NaN                        NaN
29510          NaN                        NaN
29516          NaN                        NaN
29517          NaN                        NaN
29521          NaN                        NaN

[8547 rows x 2 columns]

In [43]:
fd.corr(method='pearson')

,utility_id_ferc1,report_year,fuel_qty_burned,fuel_mmbtu_per_unit,fuel_cost_per_unit_burned,fuel_cost_per_unit_delivered,fuel_cost_per_mmbtu
utility_id_ferc1,1.000000,0.093323,-0.057447,-0.066946,-0.037863,-0.016414,0.006122
report_year,0.093323,1.000000,0.012952,-0.110853,0.013599,-0.014043,0.010261
fuel_qty_burned,-0.057447,0.012952,1.000000,-0.080946,-0.018535,-0.003551,-0.001896
fuel_mmbtu_per_unit,-0.066946,-0.110853,-0.080946,1.000000,-0.010034,-0.009039,-0.005884
fuel_cost_per_unit_burned,-0.037863,0.013599,-0.018535,-0.010034,1.000000,0.011007,-0.000437
fuel_cost_per_unit_delivered,-0.016414,-0.014043,-0.003551,-0.009039,0.011007,1.000000,-0.000109
fuel_cost_per_mmbtu,0.006122,0.010261,-0.001896,-0.005884,-0.000437,-0.000109,1.000000

In [44]:
fd.corr(method='pearson')['fuel_cost_per_unit_burned']

utility_id_ferc1               -0.037863
report_year                     0.013599
fuel_qty_burned                -0.018535
fuel_mmbtu_per_unit            -0.010034
fuel_cost_per_unit_burned       1.000000
fuel_cost_per_unit_delivered    0.011007
fuel_cost_per_mmbtu            -0.000437
Name: fuel_cost_per_unit_burned, dtype: float64

In [45]:
fd.corr(method='pearson')['fuel_cost_per_unit_burned'].min()

-0.0378627075999727

In [47]:
ft2.loc[ft2['report_year'] == 1994]

      report_year  fuel_cost_per_unit_burned
0            1994                      18.59
1            1994                      18.58
2            1994                      39.72
3            1994                      47.21
5            1994                      44.24
...           ...                        ...
1224         1994                      37.78
1227         1994                      38.23
1229         1994                      40.97
1230         1994                      39.95
1232         1994                      39.19

[475 rows x 2 columns]